jack-the-leaf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 16:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manish Sharma" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org49141ed">1. Action Items</a>
<ul>
<li><a href="#org2f36fb6">1.1. Prep</a>
<ul>
<li><a href="#org19eca42">1.1.1. <span class="todo TODO">TODO</span> Review next steps for SageMaker in documentation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jack">jack</span>&#xa0;<span class="manish">manish</span></span></a></li>
<li><a href="#org18987f8">1.1.2. <span class="todo TODO">TODO</span> Push to Github&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jack">jack</span></span></a></li>
<li><a href="#org3e21001">1.1.3. <span class="todo TODO">TODO</span> Upload to S3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="manish">manish</span></span></a></li>
</ul>
</li>
<li><a href="#orgf98bad8">1.2. Tech</a>
<ul>
<li><a href="#orgc2d8c0e">1.2.1. <span class="todo TODO">TODO</span> Run through the process with the data subset (~6000 points)</a></li>
<li><a href="#org61da58c">1.2.2. <span class="todo TODO">TODO</span> Load the model in Deeplens</a></li>
<li><a href="#org782c972">1.2.3. <span class="todo TODO">TODO</span> Prep ALL the data (.lst, and upload to S3)</a></li>
<li><a href="#org71fbe4e">1.2.4. <span class="todo TODO">TODO</span> Make SageMaker model with full data set</a></li>
<li><a href="#orgb70204d">1.2.5. <span class="todo TODO">TODO</span> Deploy model to Deeplens</a></li>
</ul>
</li>
<li><a href="#orge9858fe">1.3. Trees</a>
<ul>
<li><a href="#orgb4913ce">1.3.1. <span class="todo TODO">TODO</span> Identify the species for some for some life samples</a></li>
</ul>
</li>
<li><a href="#org5e3c398">1.4. Test Deeplens+Model on real leaves</a></li>
</ul>
</li>
<li><a href="#orgb870062">2. plant photo data set</a></li>
</ul>
</div>
</div>
<div id="outline-container-org49141ed" class="outline-2">
<h2 id="org49141ed"><span class="section-number-2">1</span> Action Items</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2f36fb6" class="outline-3">
<h3 id="org2f36fb6"><span class="section-number-3">1.1</span> Prep</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org19eca42" class="outline-4">
<h4 id="org19eca42"><span class="section-number-4">1.1.1</span> <span class="todo TODO">TODO</span> Review next steps for SageMaker in documentation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jack">jack</span>&#xa0;<span class="manish">manish</span></span></h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
</div>
<div id="outline-container-org18987f8" class="outline-4">
<h4 id="org18987f8"><span class="section-number-4">1.1.2</span> <span class="todo TODO">TODO</span> Push to Github&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jack">jack</span></span></h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
</div>
<div id="outline-container-org3e21001" class="outline-4">
<h4 id="org3e21001"><span class="section-number-4">1.1.3</span> <span class="todo TODO">TODO</span> Upload to S3&#xa0;&#xa0;&#xa0;<span class="tag"><span class="manish">manish</span></span></h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
</div>
</div>
<div id="outline-container-orgf98bad8" class="outline-3">
<h3 id="orgf98bad8"><span class="section-number-3">1.2</span> Tech</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgc2d8c0e" class="outline-4">
<h4 id="orgc2d8c0e"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> Run through the process with the data subset (~6000 points)</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
</div>
<div id="outline-container-org61da58c" class="outline-4">
<h4 id="org61da58c"><span class="section-number-4">1.2.2</span> <span class="todo TODO">TODO</span> Load the model in Deeplens</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
</div>
<div id="outline-container-org782c972" class="outline-4">
<h4 id="org782c972"><span class="section-number-4">1.2.3</span> <span class="todo TODO">TODO</span> Prep ALL the data (.lst, and upload to S3)</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
</div>
<div id="outline-container-org71fbe4e" class="outline-4">
<h4 id="org71fbe4e"><span class="section-number-4">1.2.4</span> <span class="todo TODO">TODO</span> Make SageMaker model with full data set</h4>
<div class="outline-text-4" id="text-1-2-4">
</div>
</div>
<div id="outline-container-orgb70204d" class="outline-4">
<h4 id="orgb70204d"><span class="section-number-4">1.2.5</span> <span class="todo TODO">TODO</span> Deploy model to Deeplens</h4>
<div class="outline-text-4" id="text-1-2-5">
</div>
</div>
</div>
<div id="outline-container-orge9858fe" class="outline-3">
<h3 id="orge9858fe"><span class="section-number-3">1.3</span> Trees</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgb4913ce" class="outline-4">
<h4 id="orgb4913ce"><span class="section-number-4">1.3.1</span> <span class="todo TODO">TODO</span> Identify the species for some for some life samples</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
</div>
</div>
<div id="outline-container-org5e3c398" class="outline-3">
<h3 id="org5e3c398"><span class="section-number-3">1.4</span> Test Deeplens+Model on real leaves</h3>
<div class="outline-text-3" id="text-1-4">
</div>
</div>
</div>


<div id="outline-container-orgb870062" class="outline-2">
<h2 id="orgb870062"><span class="section-number-2">2</span> plant photo data set</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">idea 1</th>
<th scope="col" class="org-left">idea 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">initial</td>
<td class="org-left">20GB</td>
<td class="org-left">44M</td>
</tr>

<tr>
<td class="org-left">unzipped</td>
<td class="org-left">22GB</td>
<td class="org-left">350M</td>
</tr>

<tr>
<td class="org-left">images</td>
<td class="org-left">included</td>
<td class="org-left">download</td>
</tr>

<tr>
<td class="org-left">data point</td>
<td class="org-left">jpg + xml</td>
<td class="org-left">a line in CSV (but need to download the corresponding image)</td>
</tr>

<tr>
<td class="org-left">number of data points</td>
<td class="org-left">0.25 mil</td>
<td class="org-left">1.1+ mil</td>
</tr>

<tr>
<td class="org-left">image size</td>
<td class="org-left">~100K</td>
<td class="org-left">~500K</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">effort needed</td>
<td class="org-left">need code to parse the data points to produce .lst file and organize corresponding images</td>
<td class="org-left">need code to take a subset of points, download and organize corresponding images and produce a .lst file</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">subset size</td>
<td class="org-left">200</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">&lt;Image&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;FileName&gt;248738.jpg&lt;/FileName&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;Species&gt;Justicia nyassana Lindau&lt;/Species&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;Origin&gt;eol&lt;/Origin&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;Author&gt;mark hyde, bart wursten and petra ballings, bart wursten, flora of zimbabwe&lt;/Author&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;Content&gt;&lt;/Content&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;Genus&gt;Justicia&lt;/Genus&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;Family&gt;Acanthaceae&lt;/Family&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;ObservationId&gt;174381&lt;/ObservationId&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;MediaId&gt;248738&lt;/MediaId&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;YearInCLEF&gt;PlantCLEF2017&lt;/YearInCLEF&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;LearnTag&gt;Train&lt;/LearnTag&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-whitespace-tab">      </span><span class="org-comment">&lt;ClassId&gt;2365&lt;/ClassId&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&lt;/Image&gt;</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">https://docs.aws.amazon.com/sagemaker/latest/dg/image-classification.html</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">A .lst file is a tab-separated file with three columns that contains</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">a list of image files. The first column specifies the image index,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the second column specifies the class label index for the image, and</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the third column specifies the relative path of the image file. The</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">image index in the first column must be unique across all of the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">images.</span>

<span class="org-keyword">from</span> bs4 <span class="org-keyword">import</span> BeautifulSoup
<span class="org-keyword">import</span> os
<span class="org-keyword">import</span> os.path

<span class="org-variable-name">lst_filename</span> = <span class="org-string">"all.lst"</span>
<span class="org-variable-name">lst_contents</span> = []
<span class="org-variable-name">index</span> = 1

<span class="org-keyword">def</span> <span class="org-function-name">parseme</span>(f):
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">r</span> = <span class="org-builtin">open</span>(f).read()
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">x</span> = BeautifulSoup(r, features=<span class="org-string">"xml"</span>)
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">fn</span> = x.Image.FileName.contents[0]
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">klass</span> = x.Image.ClassId.contents[0]
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">return</span> [fn, klass]


<span class="org-keyword">for</span> root, dirs, files <span class="org-keyword">in</span> os.walk(<span class="org-string">"."</span>):
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">for</span> f <span class="org-keyword">in</span> files:
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">extension</span> = os.path.splitext(f)[1]
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">if</span> extension == <span class="org-string">".xml"</span>:
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">fn</span>, <span class="org-variable-name">klass</span> = parseme(f)
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   lst_contents.append(<span class="org-builtin">str</span>(<span class="org-builtin">str</span>(index) + <span class="org-string">"\t"</span> + klass + <span class="org-string">"\t"</span> + <span class="org-string">"./"</span> + fn + <span class="org-string">"\n"</span>))
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-variable-name">index</span> += 1

<span class="org-keyword">with</span> <span class="org-builtin">open</span>(lst_filename, <span class="org-string">"w"</span>) <span class="org-keyword">as</span> f:
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-keyword">for</span> line <span class="org-keyword">in</span> lst_contents:
<span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   <span class="org-highlight-indentation"><span class="org-highlight-indentation"> </span></span>   f.write(line)

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manish Sharma</p>
<p class="date">Created: 2018-02-27 Tue 16:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
